app/controllers/api/v1/favorites_controller.rb

SELECT "users".* FROM "users" WHERE "users"."api_key" = ? LIMIT ?  [["api_key", "[FILTERED]"], ["LIMIT", 1]]
---
    def index
        if params[:api_key] != nil
            user = User.find_by(api_key: params[:api_key])

SELECT "users".* FROM "users" WHERE "users"."api_key" = ? LIMIT ?  [["api_key", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "favorites" ("country", "recipe_link", "recipe_title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        if params[:api_key] != nil
            user = User.find_by(api_key: params[:api_key])
            if user != nil
                favorite = user.favorites.new(favorite_params)
                if favorite.save