app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "api_key", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        if params[:password_confirmation] == nil
            render json: { error: 'Missing password confirmation' }, status: :bad_request
        else
            user = User.new(user_params)
            if user.save